app/controllers/pages_controller.rb

SELECT "categories".* FROM "categories"
SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
  def home
    @categories = Category.all
    @posts = Post.all.order("created_at DESC")

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT "rents".* FROM "rents" WHERE "rents"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 2]]
SELECT "rents".* FROM "rents" WHERE "rents"."user_id" = $1 AND "rents"."recipient" = $2 ORDER BY created_at DESC  [["user_id", 1], ["recipient", 1]]
---
  def renting_list
    if user_signed_in?
      @posts = Post.all
      @rents = Rent.where(:user_id => current_user).order("created_at DESC")
      @rents_recipient = Rent.where(:recipient => current_user).order("created_at DESC")

SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "6"], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."category_id" = $1 ORDER BY created_at DESC LIMIT $2 OFFSET $3  [["category_id", 4], ["LIMIT", 5], ["OFFSET", 0]]
---
  def offers
    if params[:category].blank?
      @posts = Post.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 5)
    else
      @category_id = Category.find_by(name: params[:category]).id
      @posts = Post.where(:category_id => @category_id).order("created_at DESC").paginate(:page => params[:page], :per_page => 5)