app/controllers/pages_controller.rb

  def offers
    @posts = Post.all.paginate(:page => params[:page], :per_page => 5)
---
SELECT  "posts".* FROM "posts" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]