app/controllers/posts_controller.rb

  def index
    @posts = Post.all.paginate(:page => params[:page], :per_page => 5)
---
SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "description", "location", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "CREATOR TEST"], ["description", "SQFDSFQSF"], ["location", "Bordeaux"], ["created_at", "2018-09-06 07:37:21.149012"], ["updated_at", "2018-09-06 07:37:21.149012"], ["user_id", 3]]