app/controllers/posts_controller.rb

  def index
    if user_signed_in?
      @posts = Post.where(:user_id => current_user).order("created_at DESC")
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 4]]