app/controllers/rents_controller.rb

SELECT "rents".* FROM "rents" WHERE "rents"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 3]]
---
  def index
    if user_signed_in?
      @posts = Post.where(:user_id => current_user).order("created_at DESC")
      @rents = Rent.where(:user_id => current_user).order("created_at DESC")

SELECT  "rents".* FROM "rents" WHERE "rents"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    @rent = Rent.find(params[:id])

INSERT INTO "rents" ("body", "delivery_adress", "delivery_time", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "rents" SET "updated_at" = $1, "user_id" = $2, "recipient" = $3 WHERE "rents"."id" = $4  [["updated_at", "2018-09-12 13:13:56.174142"], ["user_id", 1], ["recipient", 2], ["id", 18]]
---
  def create
   @rent = @post.rents.create(rent_params)
   @rent.user_id = current_user.id
   @rent.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def get_post
    @post = Post.find(params[:post_id])