app/controllers/rents_controller.rb

SELECT "rents".* FROM "rents"
---
  def index
    if user_signed_in?
      @rents = Rent.all